{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-12-25T14:28:46.4063467Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-12-25T15:03:46.7709243Z",
    "name": "MacOS - OIB - SC - Authentication - D - Platform SSO - v2.0",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "da78d257-5d79-404d-8938-54a516580f30",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_authenticationmethod",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.extensiblesso_authenticationmethod_1",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_extensionidentifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "com.microsoft.CompanyPortalMac.ssoextension"
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_platformsso",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "groupSettingCollectionValue": [
                                    {
                                        "settingValueTemplateReference": null,
                                        "children": [
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_authenticationmethod",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_authenticationmethod_1",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "groupSettingCollectionValue": [
                                                    {
                                                        "settingValueTemplateReference": null,
                                                        "children": [
                                                            {
                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping_accountname",
                                                                "settingInstanceTemplateReference": null,
                                                                "auditRuleInformation": null,
                                                                "simpleSettingValue": {
                                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                    "settingValueTemplateReference": null,
                                                                    "value": "preferred_username"
                                                                }
                                                            },
                                                            {
                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping_fullname",
                                                                "settingInstanceTemplateReference": null,
                                                                "auditRuleInformation": null,
                                                                "simpleSettingValue": {
                                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                    "settingValueTemplateReference": null,
                                                                    "value": "name"
                                                                }
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_useshareddevicekeys",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_useshareddevicekeys_true",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_userauthorizationmode",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_userauthorizationmode_1",
                                                    "children": []
                                                }
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_registrationtoken",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "{{DEVICEREGISTRATION}}"
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_screenlockedbehavior",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.extensiblesso_screenlockedbehavior_0",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_teamidentifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "UBF8T346G9"
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_type",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.extensiblesso_type_1",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_urls",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingCollectionValue": [
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.microsoftonline.com"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.microsoft.com"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://sts.windows.net"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.partner.microsoftonline.cn"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.chinacloudapi.cn"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.microsoftonline.us"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login-us.microsoftonline.com"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        }
    ]
}