{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-12-25T14:37:21.0942337Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-12-25T15:04:20.2405211Z",
    "name": "MacOS - OIB - SC - Device Security - Passcode - v2.0",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "fb008bad-bce2-4c8b-b558-02abccc9b6e6",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "passcode_passcode",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "passcode_maximuminactivityinminutes",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 15
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "passcode_changeatnextauth",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "passcode_changeatnextauth_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "passcode_failedattemptsresetinminutes",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 0
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "passcode_maximumgraceperiodinminutes",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 0
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "passcode_maximumfailedattempts",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 10
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "passcode_minimumcomplexcharacters",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 1
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "passcode_minimumlength",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 6
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "passcode_requirealphanumericpasscode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "passcode_requirealphanumericpasscode_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "passcode_requirecomplexpasscode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "passcode_requirecomplexpasscode_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "passcode_requirepasscode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "passcode_requirepasscode_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}