{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2024-08-30T10:16:37.2662981Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2026-01-28T12:04:00.5583966Z",
    "name": "MacOS - OIB - SC - Device Security - D - Firewall - v2.0",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "a608896c-de15-4f5e-ae7a-0e23fb53b1bc",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.security.firewall_blockallincoming",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.security.firewall_blockallincoming_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.security.firewall_enablefirewall",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.security.firewall_enablefirewall_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.security.firewall_enablestealthmode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.security.firewall_enablestealthmode_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}