{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2024-08-19T14:42:43.0589619Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-12-25T15:04:51.9910608Z",
    "name": "MacOS - OIB - SC - Microsoft Edge - U - Updates - v2.0",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 5,
    "technologies": "mdm,appleRemoteManagement",
    "id": "c33e1bed-c6f6-4200-a2be-355d1dd1baee",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.servicemanagement_com.apple.servicemanagement",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                "settingDefinitionId": "com.apple.servicemanagement_rules",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "groupSettingCollectionValue": [
                                    {
                                        "settingValueTemplateReference": null,
                                        "children": [
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                "settingDefinitionId": "com.apple.servicemanagement_rules_item_comment",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "simpleSettingValue": {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                    "settingValueTemplateReference": null,
                                                    "value": "Edge Updater"
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.servicemanagement_rules_item_ruletype",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.servicemanagement_rules_item_ruletype_3",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                "settingDefinitionId": "com.apple.servicemanagement_rules_item_rulevalue",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "simpleSettingValue": {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.microsoft.EdgeUpdater"
                                                }
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.managedclient.preferences_componentupdatesenabled",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "com.apple.managedclient.preferences_componentupdatesenabled_true",
                    "children": []
                }
            }
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.managedclient.preferences_relaunchnotification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "com.apple.managedclient.preferences_relaunchnotification_1",
                    "children": []
                }
            }
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.managedclient.preferences_relaunchnotificationperiod",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                    "settingValueTemplateReference": null,
                    "value": 259200000
                }
            }
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.managedclient.preferences_updatepolicyoverride",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "com.apple.managedclient.preferences_updatepolicyoverride_0",
                    "children": []
                }
            }
        }
    ]
}