{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "09decce4-cd10-4a00-891f-d9bccf2cc097",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2024-04-10T19:41:40.4173035Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2024-04-10T19:41:40.4173035Z",
  "displayName": "Win - OIB - Compliance - U - Device Security - v3.1.1",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": false,
  "secureBootEnabled": false,
  "codeIntegrityEnabled": false,
  "memoryIntegrityEnabled": false,
  "kernelDmaProtectionEnabled": false,
  "virtualizationBasedSecurityEnabled": false,
  "firmwareProtectionEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": true,
  "defenderEnabled": false,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": false,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": true,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges@odata.type": "#Collection(microsoft.graph.operatingSystemVersionRange)",
  "validOperatingSystemBuildRanges": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')",
      "id": "09decce4-cd10-4a00-891f-d9bccf2cc097",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionConfigurations('08adc93f-8209-424d-b994-839245048b85')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionsForRule('09decce4-cd10-4a00-891f-d9bccf2cc097')/scheduledActionConfigurations('08adc93f-8209-424d-b994-839245048b85')",
          "id": "08adc93f-8209-424d-b994-839245048b85",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('09decce4-cd10-4a00-891f-d9bccf2cc097')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}