{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "e87d2b39-75a0-4eca-8729-db419a7551fc",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2024-04-10T19:41:01.9475178Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2024-04-10T19:41:01.9475178Z",
  "displayName": "Win - OIB - Compliance - U - Device Health - v3.1.1",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "memoryIntegrityEnabled": false,
  "kernelDmaProtectionEnabled": false,
  "virtualizationBasedSecurityEnabled": false,
  "firmwareProtectionEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": false,
  "defenderEnabled": false,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": false,
  "antivirusRequired": false,
  "antiSpywareRequired": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": false,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges@odata.type": "#Collection(microsoft.graph.operatingSystemVersionRange)",
  "validOperatingSystemBuildRanges": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')",
      "id": "e87d2b39-75a0-4eca-8729-db419a7551fc",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionConfigurations('b28fa48d-4ea7-4e4d-83fd-46e5e89f4cf9')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionsForRule('e87d2b39-75a0-4eca-8729-db419a7551fc')/scheduledActionConfigurations('b28fa48d-4ea7-4e4d-83fd-46e5e89f4cf9')",
          "id": "b28fa48d-4ea7-4e4d-83fd-46e5e89f4cf9",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('e87d2b39-75a0-4eca-8729-db419a7551fc')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}