{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')",
  "@odata.editLink": "deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-12-10T12:22:23.800884Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-12-25T15:11:11.0843023Z",
  "name": "MacOS - OIB - SC - Device Security - D - Restrictions - v2.0",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "fac8471c-f93a-411c-b557-f931e477a19f",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.mcx_com.apple.mcx-accounts",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.mcx_disableguestaccount",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.mcx_disableguestaccount_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowaccountmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowaccountmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowactivitycontinuation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowactivitycontinuation_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowaddinggamecenterfriends",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowaddinggamecenterfriends_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowairplayincomingrequests",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowairplayincomingrequests_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowairdrop",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowairdrop_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowappleintelligencereport",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowappleintelligencereport_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowapplepersonalizedadvertising",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowapplepersonalizedadvertising_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowardremotemanagementmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowardremotemanagementmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowassistant",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowassistant_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowautounlock",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowautounlock_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowbluetoothmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowbluetoothmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowbluetoothsharingmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowbluetoothsharingmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowbookstore",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowbookstore_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowbookstoreerotica",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowbookstoreerotica_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcamera",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcamera_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudaddressbook",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudaddressbook_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudbookmarks",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudbookmarks_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudcalendar",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudcalendar_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowclouddesktopanddocuments",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowclouddesktopanddocuments_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowclouddocumentsync",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowclouddocumentsync_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudfreeform",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudfreeform_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudkeychainsync",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudkeychainsync_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudmail",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudmail_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudnotes",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudnotes_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudphotolibrary",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudphotolibrary_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudprivaterelay",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudprivaterelay_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcloudreminders",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcloudreminders_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowcontentcaching",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowcontentcaching_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowdefinitionlookup",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowdefinitionlookup_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowdevicenamemodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowdevicenamemodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowdiagnosticsubmission",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowdiagnosticsubmission_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowdictation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowdictation_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowerasecontentandsettings",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowerasecontentandsettings_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowexplicitcontent",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowexplicitcontent_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowexternalintelligenceintegrations",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowexternalintelligenceintegrations_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowexternalintelligenceintegrationssignin",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowexternalintelligenceintegrationssignin_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowfilesharingmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowfilesharingmodification_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowfindmydevice",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowfindmydevice_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowfindmyfriends",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowfindmyfriends_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowfingerprintforunlock",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowfingerprintforunlock_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowfingerprintmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowfingerprintmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowgamecenter",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowgamecenter_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowgenmoji",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowgenmoji_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowimageplayground",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowimageplayground_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowinternetsharingmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowinternetsharingmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowiphonemirroring",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowiphonemirroring_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowitunesfilesharing",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowitunesfilesharing_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowlocalusercreation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowlocalusercreation_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowmailsmartreplies",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowmailsmartreplies_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowmailsummary",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowmailsummary_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowmediasharingmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowmediasharingmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowmultiplayergaming",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowmultiplayergaming_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowmusicservice",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowmusicservice_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allownotestranscription",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allownotestranscription_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allownotestranscriptionsummary",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allownotestranscriptionsummary_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowpasscodemodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowpasscodemodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowpasswordautofill",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowpasswordautofill_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowpasswordproximityrequests",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowpasswordproximityrequests_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowpasswordsharing",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowpasswordsharing_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowprintersharingmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowprintersharingmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowrapidsecurityresponseinstallation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowrapidsecurityresponseinstallation_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowrapidsecurityresponseremoval",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowrapidsecurityresponseremoval_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowremoteappleeventsmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowremoteappleeventsmodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowremotescreenobservation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowremotescreenobservation_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowsafarihistoryclearing",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowsafarihistoryclearing_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowsafariprivatebrowsing",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowsafariprivatebrowsing_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowsafarisummary",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowsafarisummary_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowscreenshot",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowscreenshot_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowspotlightinternetresults",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowspotlightinternetresults_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowstartupdiskmodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowstartupdiskmodification_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowtimemachinebackup",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowtimemachinebackup_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowuiconfigurationprofileinstallation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowuiconfigurationprofileinstallation_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowuniversalcontrol",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowuniversalcontrol_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowusbrestrictedmode",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowusbrestrictedmode_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowwallpapermodification",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowwallpapermodification_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_allowwritingtools",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_allowwritingtools_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_forcebypassscreencapturealert",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_forcebypassscreencapturealert_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_forceondeviceonlydictation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_forceondeviceonlydictation_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.applicationaccess_safariallowautofill",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.applicationaccess_safariallowautofill_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/settings('1')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fac8471c-f93a-411c-b557-f931e477a19f')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
