{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')",
  "@odata.editLink": "deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-12-25T14:28:46.4063467Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-12-25T15:03:46.7709243Z",
  "name": "MacOS - OIB - SC - Authentication - D - Platform SSO - v2.0",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 1,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "da78d257-5d79-404d-8938-54a516580f30",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_authenticationmethod",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.extensiblesso_authenticationmethod_1",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_extensionidentifier",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.microsoft.CompanyPortalMac.ssoextension"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.extensiblesso_platformsso",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_platformsso_authenticationmethod",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_platformsso_authenticationmethod_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                        "groupSettingCollectionValue": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                            "settingValueTemplateReference": null,
                            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                            "children": [
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping_accountname",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "preferred_username"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping_fullname",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "name"
                                }
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_platformsso_useshareddevicekeys",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_platformsso_useshareddevicekeys_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_platformsso_userauthorizationmode",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_platformsso_userauthorizationmode_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_registrationtoken",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "{{DEVICEREGISTRATION}}"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_screenlockedbehavior",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.extensiblesso_screenlockedbehavior_0",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_teamidentifier",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "UBF8T346G9"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_type",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.extensiblesso_type_1",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                "settingDefinitionId": "com.apple.extensiblesso_urls",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                "simpleSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.microsoftonline.com"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.microsoft.com"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://sts.windows.net"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.partner.microsoftonline.cn"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.chinacloudapi.cn"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.microsoftonline.us"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login-us.microsoftonline.com"
                  }
                ]
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/settings('0')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('da78d257-5d79-404d-8938-54a516580f30')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
