{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')",
  "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-11-27T15:39:45.7604943Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-12-25T15:04:05.1636025Z",
  "name": "MacOS - OIB - SC - Defender Antivirus - D - MDE Configuration - v2.0",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 6,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "5627e213-b784-438b-9ed0-226a82df4e19",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.servicemanagement_com.apple.servicemanagement",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.servicemanagement_rules",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_comment",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.dlp"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_ruletype",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.servicemanagement_rules_item_ruletype_0",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_rulevalue",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.fresno"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_teamidentifier",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "UBF8T346G9"
                        }
                      }
                    ]
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_comment",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.dlp"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_ruletype",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.servicemanagement_rules_item_ruletype_0",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_rulevalue",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.dlp"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_teamidentifier",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "UBF8T346G9"
                        }
                      }
                    ]
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_comment",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.wdav"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_ruletype",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.servicemanagement_rules_item_ruletype_0",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_rulevalue",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.wdav"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.servicemanagement_rules_item_teamidentifier",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "UBF8T346G9"
                        }
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_datalossprevention",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_datalossprevention_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                        "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_accessibility",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                        "groupSettingCollectionValue": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                            "settingValueTemplateReference": null,
                            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                            "children": [
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_authorization",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_authorization_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_coderequirement",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "identifier \"com.microsoft.dlp.daemon\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_identifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.microsoft.dlp.daemon"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_identifiertype",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_identifiertype_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_staticcode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_accessibility_item_staticcode_false",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                        "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                        "groupSettingCollectionValue": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                            "settingValueTemplateReference": null,
                            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                            "children": [
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_coderequirement",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "identifier \"com.microsoft.wdav\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.microsoft.wdav"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode_false",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              }
                            ]
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                            "settingValueTemplateReference": null,
                            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                            "children": [
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_coderequirement",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "identifier \"com.microsoft.wdav.epsext\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.microsoft.wdav.epsext"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode_false",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              }
                            ]
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                            "settingValueTemplateReference": null,
                            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                            "children": [
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_coderequirement",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "identifier \"com.microsoft.dlp.daemon\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.microsoft.dlp.daemon"
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype_0",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              },
                              {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                  "settingValueTemplateReference": null,
                                  "value": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode_false",
                                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                  "children": []
                                }
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.system-extension-policy_allowuseroverrides",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.system-extension-policy_allowuseroverrides_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.system-extension-policy_allowedsystemextensions",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                        "settingDefinitionId": "com.apple.system-extension-policy_allowedsystemextensions_generickey",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                        "simpleSettingCollectionValue": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "com.microsoft.wdav.epsext"
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "com.microsoft.wdav.netext"
                          }
                        ]
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.system-extension-policy_allowedsystemextensions_generickey_keytobereplaced",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "UBF8T346G9"
                        }
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.notificationsettings_com.apple.notificationsettings",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.notificationsettings_notificationsettings",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_alerttype",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_alerttype_2",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_badgesenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_badgesenabled_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_bundleidentifier",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.autoupdate2"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled_false",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_notificationsenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_notificationsenabled_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_showinlockscreen",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_showinlockscreen_false",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_soundsenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_soundsenabled_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      }
                    ]
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_alerttype",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_alerttype_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_badgesenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_badgesenabled_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_bundleidentifier",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.microsoft.wdav.tray"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled_false",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_notificationsenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_notificationsenabled_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_showinlockscreen",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_showinlockscreen_false",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.notificationsettings_notificationsettings_item_soundsenabled",
                        "settingInstanceTemplateReference": null,
                        "auditRuleInformation": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.notificationsettings_notificationsettings_item_soundsenabled_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_filterdataproviderbundleidentifier",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.microsoft.wdav.netext"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_filterdataproviderdesignatedrequirement",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "identifier \"com.microsoft.wdav.netext\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_filtergrade",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.webcontent-filter_filtergrade_1",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_filterpackets",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.webcontent-filter_filterpackets_false",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_filtersockets",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.webcontent-filter_filtersockets_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_filtertype",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.webcontent-filter_filtertype_1",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_pluginbundleid",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.microsoft.wdav"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.webcontent-filter_userdefinedname",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "MDE Network Filter"
                }
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/settings('5')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('5627e213-b784-438b-9ed0-226a82df4e19')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
