{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')",
  "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2024-08-30T10:17:13.6247849Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-12-25T15:06:25.2151171Z",
  "name": "MacOS - OIB - SC - Microsoft OneDrive - U - Known Folder Move - v2.0",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 15,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "1ca2dd46-7a65-4006-aee0-9d1ab134f7d9",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptin",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "%OrganizationId%"
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_blockexternalsync",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_blockexternalsync_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_disableautoconfig",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_disableautoconfig_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_disablepersonalsync",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_disablepersonalsync_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_disabletutorial",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_disabletutorial_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptinwithnotification",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmsilentoptinwithnotification_false",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_filesondemandenabled",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_filesondemandenabled_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('6')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('7')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('7')",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_enableallocsiclients",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_enableallocsiclients_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('7')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('7')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('8')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('8')",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmblockoptout",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmblockoptout_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('8')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('8')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('9')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('9')",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_hidedockicon",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_hidedockicon_false",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('9')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('9')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('10')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('10')",
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_enableodignore",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "simpleSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
        "simpleSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "settingValueTemplateReference": null,
            "value": "*.lnk"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "settingValueTemplateReference": null,
            "value": "*.pst"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "settingValueTemplateReference": null,
            "value": "*.pkg"
          },
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
            "settingValueTemplateReference": null,
            "value": "*.dmg"
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('10')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('10')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('11')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('11')",
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptindesktop",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmsilentoptindesktop_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('11')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('11')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('12')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('12')",
      "id": "12",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptindocuments",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmsilentoptindocuments_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('12')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('12')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('13')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('13')",
      "id": "13",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_openatlogin",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_openatlogin_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('13')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('13')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('14')",
      "@odata.editLink": "deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('14')",
      "id": "14",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmoptinwithwizard",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "%OrganizationId%"
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('14')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/settings('14')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1ca2dd46-7a65-4006-aee0-9d1ab134f7d9')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
