{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "d95ee62e-8813-4f29-89aa-758ec869fb21",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2024-08-19T17:13:57.4921392Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2024-08-19T17:13:57.4921392Z",
  "displayName": "MacOS - OIB - Compliance - U - Device Security - v1.0",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passwordRequiredType": "deviceDefault",
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "systemIntegrityProtectionEnabled": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "storageRequireEncryption": true,
  "gatekeeperAllowedAppSource@odata.type": "#microsoft.graph.macOSGatekeeperAppSources",
  "gatekeeperAllowedAppSource": "macAppStoreAndIdentifiedDevelopers",
  "firewallEnabled": true,
  "firewallBlockAllIncoming": false,
  "firewallEnableStealthMode": false,
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')",
      "id": "d95ee62e-8813-4f29-89aa-758ec869fb21",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionConfigurations('2c29e39b-70b8-41c3-acc2-015930becc07')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionsForRule('d95ee62e-8813-4f29-89aa-758ec869fb21')/scheduledActionConfigurations('2c29e39b-70b8-41c3-acc2-015930becc07')",
          "id": "2c29e39b-70b8-41c3-acc2-015930becc07",
          "gracePeriodHours": 12,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.macOSCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('d95ee62e-8813-4f29-89aa-758ec869fb21')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}